---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RenderFailures.LightSourceInsideGeometry
source: html/71f52490-cfce-db3b-0aa0-e3cab84805d4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RenderFailures.LightSourceInsideGeometry Property

Light source is inside solid geometry. No light will be emitted during rendering.

## Syntax (C#)
```csharp
public static FailureDefinitionId LightSourceInsideGeometry { get; }
```